       IDENTIFICATION DIVISION.
       PROGRAM-ID.     HELLOWORLD.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       FILE SECTION.

       PROCEDURE DIVISION.

       MAIN-LOGIC SECTION.
       BEGIN.
           DISPLAY " "
           DISPLAY "Hello world!"
           STOP RUN.
       MAIN-LOGIC-EXIT.
           EXIT.
